; Warframe Cetus Time by DelFuN
; https://github.com/delfunua/rainmeter-warframe-cetus-time-tracker

[Rainmeter]
Author=DelFuN
Background=#@#Background.png
BackgroundMode=2
BackgroundMargins=0,34,10,5
Update=1000
AccurateText=1
DynamicWindowSize=1

[Metadata]
Name=Warframe Cetus Time
Description=Displays current Warframe Cetus time
Version=1.0.4

[Variables]
StampDiff = 11644473600
TimeUntil = 0
TimeNext = 0

[MeasureSite]
Measure=Plugin
Plugin=WebParser.dll
UpdateDivider=10
URL=http://content.warframe.com/dynamic/worldState.php
RegExp=(?siU)"Activation":\{"\$date":\{"\$numberLong":"([0-9]{10})[0-9]*"}},"Expiry":\{"\$date":\{"\$numberLong":"([0-9]{10})[0-9]*"}},"Tag":"CetusSyndicate"

[UnixStart]
Measure=Plugin
Plugin=WebParser.dll
UpdateDivider=1
URL=[MeasureSite]
StringIndex=1

[UnixEnd]
Measure=Plugin
Plugin=WebParser.dll
UpdateDivider=1
URL=[MeasureSite]
StringIndex=2

[GmtTime0]
Measure=Time
TimeZone=0

[GmtTime1]
Measure=Time
TimeZone=0
DaylightSavingTime=0

[WinCurTime]
Measure=Time

[ZoneDiff]
Measure=Calc
Formula=(WinCurTime - GmtTime0)

[TimeDiff]
Measure=Calc
Formula=(GmtTime0 - GmtTime1)

[TimeAtDay]
Measure=Calc
Formula=(TimeDiff + UnixEnd + #StampDiff# + ZoneDiff)

[TimeAtNight]
Measure=Calc
Formula=(TimeDiff + UnixEnd + #StampDiff# + ZoneDiff - 3000)

[TimeAtNight2]
Measure=Calc
Formula=(TimeDiff + UnixEnd + #StampDiff# + ZoneDiff + 6000)

[TimeUntilDay]
Measure=Calc
Formula=(TimeAtDay - WinCurTime)

[TimeUntilNight]
Measure=Calc
Formula=(TimeAtNight - WinCurTime)

[TimeUntilNight2]
Measure=Calc
Formula=(TimeAtNight2 - WinCurTime)

[CheckTime]
Measure=Calc
IfCondition=(TimeUntilNight > 0)
IfTrueAction=[!SetVariable TimeUntil [TimeUntilNight]] [!SetVariable TimeNext [TimeAtNight]]
IfCondition2=(TimeUntilDay > 0) && (TimeUntilNight < 0)
IfTrueAction2=[!SetVariable TimeUntil [TimeUntilDay]] [!SetVariable TimeNext [TimeAtDay]]
IfCondition3=(TimeUntilDay < 0) && (TimeUntilNight < 0)
IfTrueAction3=[!SetVariable TimeUntil [TimeUntilNight2]] [!SetVariable TimeNext [TimeAtNight2]]
IfCondition4=(WinCurTime - 6000 > TimeAtDay)
IfTrueAction4=[!SetVariable TimeUntil "???"] [!SetVariable TimeNext "???"]
IfConditionMode=1

[TimeUntilTime]
Measure=Time
DynamicVariables=1
TimeStamp=#TimeUntil#
Format=%H:%M:%S

[TimeNextTime]
Measure=Time
DynamicVariables=1
TimeStamp=#TimeNext#
Format=%H:%M:%S

[CheckMeasure]
Measure=Calc
DynamicVariables=1
IfCondition=(TimeUntilNight > 0)
IfTrueAction=[!SetOption CurrentMeter Text "Currently is Day"][!SetOption CurrentMeter FontColor 255,128,0,205][!SetOption UntilMeter Text "Time until Night"][!SetOption NextMeter Text "Time at Night"]
IfCondition2=(TimeUntilDay > 0) && (TimeUntilNight < 0)
IfTrueAction2=[!SetOption CurrentMeter Text "Currently is Night"][!SetOption CurrentMeter FontColor 0,128,255,205][!SetOption UntilMeter Text "Time until Day"][!SetOption NextMeter Text "Time at Day"]
IfCondition3=(TimeUntilDay < 0) && (TimeUntilNight < 0)
IfTrueAction3=[!SetOption CurrentMeter Text "Currently is Day"][!SetOption CurrentMeter FontColor 255,128,0,205][!SetOption UntilMeter Text "Time until Night"][!SetOption NextMeter Text "Time at Night"]
IfCondition4=(WinCurTime - 6000 > TimeAtDay)
IfTrueAction4=[!SetOption CurrentMeter Text "Currently Unavaible"][!SetOption CurrentMeter FontColor 255,0,0,205][!SetOption UntilMeter Text "Undefined"][!SetOption NextMeter Text "Undefined"]
OnUpdateAction=[!UpdateMeter CurrentMeter][!UpdateMeter UntilMeter][!UpdateMeter NextMeter][!Redraw]

;=========================

[styleTitle]
StringAlign=CENTER
StringCase=UPPER
StringStyle=BOLD
StringEffect=SHADOW
FontEffectColor=0,0,0,50
FontFace=Trebuchet MS
FontSize=10
AntiAlias=1

[styleLeftText]
StringAlign=LEFT
StringCase=NONE
StringStyle=BOLD
StringEffect=SHADOW
FontEffectColor=0,0,0,20
FontColor=255,255,255,205
FontFace=Trebuchet MS
FontSize=8
AntiAlias=1
ClipString=1

[styleRightText]
StringAlign=RIGHT
StringCase=NONE
StringStyle=BOLD
StringEffect=SHADOW
FontEffectColor=0,0,0,20
FontColor=255,255,255,205
FontFace=Trebuchet MS
FontSize=8
AntiAlias=1

;===================

[TitleMeter]
Meter=String
MeterStyle=styleTitle
FontColor=255,255,255,205
X=100
Y=12
W=140
H=18
Text="Warframe Cetus Timer"

[CurrentMeter]
Meter=String
MeterStyle=styleTitle
X=100
Y=40
W=140
H=14

[UntilMeter]
Meter=String
MeterStyle=styleLeftText
X=10
Y=60
W=140
H=14

[UntilTimeMeter]
Meter=String
MeterStyle=styleRightText
MeasureName=TimeUntilTime
X=198
Y=60
W=130
H=14

[NextMeter]
MeterStyle=styleLeftText
Meter=STRING
X=10
Y=76
W=130
H=14

[NextTimeMeter]
Meter=String
MeterStyle=styleRightText
MeasureName=TimeNextTime
X=198
Y=76
W=130
H=14